import React from "react";
import Layout from "../src/components/Layout/Layout"; 
import "./App.css"; 

const App: React.FC = () => {
  return (
    <Layout>
      <div className="canvas">
        <p>Какво е аутизъм?
Аутизмът е невроразвитийно разстройство, което засяга начина, по който човек възприема света, общува и взаимодейства с околните. Хората с аутизъм могат да имат затруднения в социалните умения, комуникацията и поведението, но също така притежават уникални способности и начини на мислене.

Основни характеристики:
Различен начин на комуникация – някои деца с аутизъм са невербални, докато други говорят, но имат затруднения с разбирането на социални намеци.
Чувствителност към сетивни стимули – могат да реагират различно на звуци, светлина, допир или миризми.
Предпочитание към рутина – повтарящи се действия и трудности при внезапни промени.
Силни страни – способност за детайлно мислене, аналитични умения, висока концентрация в определени области.

Нашата мисия
Проектът „Моето другарче“ е създаден, за да предостави подкрепяща и интуитивна среда за обучение и развитие на деца с аутизъм. Чрез интерактивни игри и адаптирани задачи, платформата помага за подобряване на социалните и комуникативните умения, като същевременно насърчава самостоятелността и увереността.

Заедно можем да създадем по-достъпна и подкрепяща среда за всяко дете!</p>
      </div>
    </Layout>
  );
};

export default App;
